app/Controllers/TemperaturaController.php

SELECT *
FROM `Temperatura`
WHERE `Temperatura`.`deleted_at` IS NULL
---
    public function getTemperaturas(){
        $model = model('TemperaturaModel');
        $data['temperaturas'] = $model->findAll();